app/views/resources/show.html.erb

  <strong>Category:</strong>
  <%= Category.find(@resource.category_id).name %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]

  <strong>Owner:</strong>
  <%= User.find(@resource.owner_id).name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]