app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @categories = Category.all
	@current_user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
	@current_user = User.find(session[:user_id])

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save