app/controllers/resources_controller.rb

UPDATE "resources" SET "score" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["score", 1], ["updated_at", "2016-10-25 13:57:52.812412"], ["id", 2]]
---
  def like
    @resource.score = @resource.score + 1

      respond_to do |format|
        if @resource.save

UPDATE "resources" SET "score" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["score", 0], ["updated_at", "2016-10-25 13:58:31.776450"], ["id", 2]]
---
  def dislike
    @resource.score = @resource.score - 1

      respond_to do |format|
        if @resource.save

SELECT "categories".* FROM "categories"
---
  def new
    @resource = Resource.new
	@categories = Category.all.map{|c| [ c.name, c.id ] }

INSERT INTO "resources" ("name", "description", "link", "file_file_name", "file_content_type", "file_file_size", "file_updated_at", "last_modified", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @resource = Resource.new(resource_params)
    @resource.score = 0
	@resource.last_modified = Date.today
	@resource.owner_id = current_user.id
	@resource.category_id = params[:category_id]

    respond_to do |format|
      if @resource.save

UPDATE "resources" SET "link" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["link", "https://github.com/media-programming-rails/example-app/blob/master/app/controllers/habits_controller.rb"], ["updated_at", "2016-10-25 13:53:12.542907"], ["id", 2]]
---
  def update
	@resource.owner_id = current_user.id
	@resource.category_id = params[:category_id]

    respond_to do |format|
      if @resource.update(resource_params)